In [1]:
import pandas as pd

In [2]:
from pandas import Series, DataFrame

In [3]:
obj = pd.Series([4, 7, 5, 3])

In [4]:
obj

0    4
1    7
2    5
3    3
dtype: int64

In [5]:
obj2 = pd.Series([4, 7, 5 ,3], index = ['a', 'b', 'c', 'd'])

In [6]:
obj2

a    4
b    7
c    5
d    3
dtype: int64

In [7]:
obj2.name = 'number'

In [8]:
obj2

a    4
b    7
c    5
d    3
Name: number, dtype: int64

In [9]:
data = {'state' : ['ohio', 'ohio', 'ohio', 'nevada' ,'nevada', 'nevada'],
       'year' : [2000, 2001, 2002, 2001, 2002, 2003],
       'pop' : [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)

In [10]:
frame

    state  year  pop
0    ohio  2000  1.5
1    ohio  2001  1.7
2    ohio  2002  3.6
3  nevada  2001  2.4
4  nevada  2002  2.9
5  nevada  2003  3.2

In [11]:
pd,DataFrame(data, columns = ['year', 'pop', 'state'])

(<module 'pandas' from 'C:\\ProgramData\\Anaconda3\\lib\\site-packages\\pandas\\__init__.py'>,
    year  pop   state
 0  2000  1.5    ohio
 1  2001  1.7    ohio
 2  2002  3.6    ohio
 3  2001  2.4  nevada
 4  2002  2.9  nevada
 5  2003  3.2  nevada)

In [17]:
frame['pop'] = np.arange(6)

In [13]:
import numpy as np

In [18]:
obj = pd.Series(range(3), index = ['a', 'b', 'c'])

In [19]:
index = obj.index

In [20]:
index

Index(['a', 'b', 'c'], dtype='object')

In [21]:
obj

a    0
b    1
c    2
dtype: int64

In [22]:
obj = obj.reindex(['c', 'd','e','f'])

In [23]:
obj

c    2.0
d    NaN
e    NaN
f    NaN
dtype: float64

In [24]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index = [0,2,4])

In [25]:
obj3

0      blue
2    purple
4    yellow
dtype: object

In [26]:
obj3.reindex(range(6), method = 'ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [28]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),
                     index = ['a', 'b', 'c'],
                     columns = ['ohio' , 'texas', 'california'])

In [29]:
frame

   ohio  texas  california
a     0      1           2
b     3      4           5
c     6      7           8

In [30]:
states = ['texas' ,'utah', 'california']

In [31]:
frame.reindex(columns = states)

   texas  utah  california
a      1   NaN           2
b      4   NaN           5
c      7   NaN           8

In [32]:
frame

   ohio  texas  california
a     0      1           2
b     3      4           5
c     6      7           8

In [33]:
data

{'state': ['ohio', 'ohio', 'ohio', 'nevada', 'nevada', 'nevada'],
 'year': [2000, 2001, 2002, 2001, 2002, 2003],
 'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [38]:
data = pd.DataFrame(data)

In [39]:
data

Empty DataFrame
Columns: []
Index: []

In [40]:
data

Empty DataFrame
Columns: []
Index: []

In [41]:
frame

   ohio  texas  california
a     0      1           2
b     3      4           5
c     6      7           8

In [43]:
frame.iloc[2]

ohio          6
texas         7
california    8
Name: c, dtype: int32

In [44]:
frame.loc[:'b', 'texas']

a    1
b    4
Name: texas, dtype: int32

In [46]:
df1 = pd.DataFrame(np.arange(12).reshape(3, 4),
                  columns = list('abcd'))

In [47]:
df2 = pd.DataFrame(np.arange(20).reshape(4, 5),
                  columns = list('abcde'))

In [48]:
df1

   a  b   c   d
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [49]:
df2

    a   b   c   d   e
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [50]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [51]:
df1.add(df2, fill_value = 0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [55]:
frame = pd.DataFrame(np.random.randn(4, 3), columns = list('bde'),
                    index = ['utah', 'ohio', 'texas', 'oregon'])

In [56]:
frame

               b         d         e
utah   -0.508383 -0.254815 -1.841023
ohio   -0.034394 -0.345429 -1.033357
texas   1.201908 -1.354833 -1.182830
oregon -0.498589 -1.501960 -1.249523

In [57]:
np.abs(frame)

               b         d         e
utah    0.508383  0.254815  1.841023
ohio    0.034394  0.345429  1.033357
texas   1.201908  1.354833  1.182830
oregon  0.498589  1.501960  1.249523